In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

In [4]:
df =sns.load_dataset('taxis')

In [6]:
df

,pickup,dropoff,passengers,distance,fare,tip,tolls,total,color,payment,pickup_zone,dropoff_zone,pickup_borough,dropoff_borough
0,2019-03-23 20:21:09,2019-03-23 20:27:24,1,1.60,7.0,2.15,0.0,12.95,yellow,credit card,Lenox Hill West,UN/Turtle Bay South,Manhattan,Manhattan
1,2019-03-04 16:11:55,2019-03-04 16:19:00,1,0.79,5.0,0.00,0.0,9.30,yellow,cash,Upper West Side South,Upper West Side South,Manhattan,Manhattan
2,2019-03-27 17:53:01,2019-03-27 18:00:25,1,1.37,7.5,2.36,0.0,14.16,yellow,credit card,Alphabet City,West Village,Manhattan,Manhattan
3,2019-03-10 01:23:59,2019-03-10 01:49:51,1,7.70,27.0,6.15,0.0,36.95,yellow,credit card,Hudson Sq,Yorkville West,Manhattan,Manhattan
4,2019-03-30 13:27:42,2019-03-30 13:37:14,3,2.16,9.0,1.10,0.0,13.40,yellow,credit card,Midtown East,Yorkville West,Manhattan,Manhattan
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
6428,2019-03-31 09:51:53,2019-03-31 09:55:27,1,0.75,4.5,1.06,0.0,6.36,green,credit card,East Harlem North,Central Harlem North,Manhattan,Manhattan
6429,2019-03-31 17:38:00,2019-03-31 18:34:23,1,18.74,58.0,0.00,0.0,58.80,green,credit card,Jamaica,East Concourse/Concourse Village,Queens,Bronx
6430,2019-03-23 22:55:18,2019-03-23 23:14:25,1,4.14,16.0,0.00,0.0,17.30,green,cash,Crown Heights North,Bushwick North,Brooklyn,Brooklyn
6431,2019-03-04 10:09:25,2019-03-04 10:14:29,1,1.12,6.0,0.00,0.0,6.80,green,credit card,East New York,East Flatbush/Remsen Village,Brooklyn,Brooklyn
6432,2019-03-13 19:31:22,2019-03-13 19:48:02,1,3.85,15.0,3.36,0.0,20.16,green,credit card,Boerum Hill,Windsor Terrace,Brooklyn,Brooklyn

In [8]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6433 entries, 0 to 6432
Data columns (total 14 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   pickup           6433 non-null   datetime64[ns]
 1   dropoff          6433 non-null   datetime64[ns]
 2   passengers       6433 non-null   int64
 3   distance         6433 non-null   float64
 4   fare             6433 non-null   float64
 5   tip              6433 non-null   float64
 6   tolls            6433 non-null   float64
 7   total            6433 non-null   float64
 8   color            6433 non-null   object
 9   payment          6389 non-null   object
 10  pickup_zone      6407 non-null   object
 11  dropoff_zone     6388 non-null   object
 12  pickup_borough   6407 non-null   object
 13  dropoff_borough  6388 non-null   object
dtypes: datetime64[ns](2), float64(5), int64(1), object(6)
memory usage: 703.7+ KB

In [9]:
sns.load_dataset('dowjones')

          Date   Price
0   1914-12-01   55.00
1   1915-01-01   56.55
2   1915-02-01   56.00
3   1915-03-01   58.30
4   1915-04-01   66.45
..         ...     ...
644 1968-08-01  883.72
645 1968-09-01  922.80
646 1968-10-01  955.47
647 1968-11-01  964.12
648 1968-12-01  965.39

[649 rows x 2 columns]

In [10]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6433 entries, 0 to 6432
Data columns (total 14 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   pickup           6433 non-null   datetime64[ns]
 1   dropoff          6433 non-null   datetime64[ns]
 2   passengers       6433 non-null   int64
 3   distance         6433 non-null   float64
 4   fare             6433 non-null   float64
 5   tip              6433 non-null   float64
 6   tolls            6433 non-null   float64
 7   total            6433 non-null   float64
 8   color            6433 non-null   object
 9   payment          6389 non-null   object
 10  pickup_zone      6407 non-null   object
 11  dropoff_zone     6388 non-null   object
 12  pickup_borough   6407 non-null   object
 13  dropoff_borough  6388 non-null   object
dtypes: datetime64[ns](2), float64(5), int64(1), object(6)
memory usage: 703.7+ KB

In [12]:
df = sns.load_dataset('flights')

In [13]:
df

     year month  passengers
0    1949   Jan         112
1    1949   Feb         118
2    1949   Mar         132
3    1949   Apr         129
4    1949   May         121
..    ...   ...         ...
139  1960   Aug         606
140  1960   Sep         508
141  1960   Oct         461
142  1960   Nov         390
143  1960   Dec         432

[144 rows x 3 columns]

In [14]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 144 entries, 0 to 143
Data columns (total 3 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   year        144 non-null    int64
 1   month       144 non-null    category
 2   passengers  144 non-null    int64
dtypes: category(1), int64(2)
memory usage: 2.9 KB

In [15]:
df['month_number']

KeyError: 'month_number'

In [2]:

import pandas as pd

# Sample data with mixed date formats
data = {
    'id': [1, 2, 3, 4, 5, 6],
    'raw_date': [
        '2025-10-06',     # ISO format
        '06/10/2025',     # European format (DD/MM/YYYY)
        '10/06/2025',     # US format (MM/DD/YYYY)
        'October 6, 2025',# Full month name
        '06-Oct-2025',    # Abbreviated month
        '20251006'        # Compact YYYYMMDD
    ]
}

# Create DataFrame
df = pd.DataFrame(data)

print(df)

   id         raw_date
0   1       2025-10-06
1   2       06/10/2025
2   3       10/06/2025
3   4  October 6, 2025
4   5      06-Oct-2025
5   6         20251006

In [3]:
df

   id         raw_date
0   1       2025-10-06
1   2       06/10/2025
2   3       10/06/2025
3   4  October 6, 2025
4   5      06-Oct-2025
5   6         20251006

In [5]:
pd.to_datetime(df['raw_date'][1:2],format = 'mixed')

1   2025-06-10
Name: raw_date, dtype: datetime64[ns]

In [6]:
pd.to_datetime(df['raw_date'], errors='coerce')

0   2025-10-06
1          NaT
2          NaT
3          NaT
4          NaT
5          NaT
Name: raw_date, dtype: datetime64[ns]

In [9]:
a = pd.to_datetime(df['raw_date'][1:2],format = 'mixed')

In [10]:
a

1   2025-06-10
Name: raw_date, dtype: datetime64[ns]

In [11]:
a.dt

In [12]:
a.dt.year

1    2025
Name: raw_date, dtype: int32

In [13]:
a.dt.month

1    6
Name: raw_date, dtype: int32

In [14]:
a.dt.month_name()

1    June
Name: raw_date, dtype: object

In [15]:
import pandas as pd

# Sample sales data
data = {
    'sale_id': [101, 102, 103, 104, 105],
    'product': ['Widget', 'Gadget', 'Widget', 'Thingy', 'Gadget'],
    'quantity': [3, 5, 2, 7, 1],
    'price_per_unit': [20.0, 15.5, 20.0, 10.0, 15.5],
    'sale_date': [
        '2025-10-01',
        '2025-10-02',
        '2025-10-03',
        '2025-10-03',
        '2025-10-04'
    ]
}
# Create DataFrame
df = pd.DataFrame(data)

# Calculate total

In [16]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 5 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   sale_id         5 non-null      int64
 1   product         5 non-null      object
 2   quantity        5 non-null      int64
 3   price_per_unit  5 non-null      float64
 4   sale_date       5 non-null      object
dtypes: float64(1), int64(2), object(2)
memory usage: 332.0+ bytes

In [17]:
df['order_date'] = pd.to_datetime(df['sale_date'])

In [18]:
df

   sale_id product  quantity  price_per_unit   sale_date order_date
0      101  Widget         3            20.0  2025-10-01 2025-10-01
1      102  Gadget         5            15.5  2025-10-02 2025-10-02
2      103  Widget         2            20.0  2025-10-03 2025-10-03
3      104  Thingy         7            10.0  2025-10-03 2025-10-03
4      105  Gadget         1            15.5  2025-10-04 2025-10-04

In [19]:
df['order_date'].dt.day_name()

0    Wednesday
1     Thursday
2       Friday
3       Friday
4     Saturday
Name: order_date, dtype: object

In [20]:
df.groupby(df['order_date'].dt.day_name()).sum('price_per_unit')

            sale_id  quantity  price_per_unit
order_date
Friday          207         9            30.0
Saturday        105         1            15.5
Thursday        102         5            15.5
Wednesday       101         3            20.0